In [2]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([1,3,7,9,15], index=['Atom', 'Beton','Skvara', 'Akvarel', 'Mezonet'])
print(s)

Atom        1
Beton       3
Skvara      7
Akvarel     9
Mezonet    15
dtype: int64

In [32]:
data = {'Kraj': ['Bratislavsky', 'Trnavsky', 'Kosicky'],
       'Mesto':['Pezinok', 'Trnava', 'Kosice'],
       'Hodnoty': [54, 32, 87]}
df = pd.DataFrame(data, columns=["Kraj", "Mesto", "Hodnoty"])
print(df)

           Kraj    Mesto  Hodnoty
0  Bratislavsky  Pezinok       54
1      Trnavsky   Trnava       32
2       Kosicky   Kosice       87

In [5]:
df.drop('Mesto', axis=1)

           Kraj  Hodnoty
1  Bratislavsky       54
2      Trnavsky       32
3       Kosicky       87

In [6]:
df.sort_index()
df.sort_values(by='Hodnoty')

           Kraj    Mesto  Hodnoty
2      Trnavsky   Trnava       32
1  Bratislavsky  Pezinok       54
3       Kosicky   Kosice       87

In [7]:
df.rank()

   Kraj  Mesto  Hodnoty
1   1.0    2.0      2.0
2   3.0    3.0      1.0
3   2.0    1.0      3.0

In [8]:
df['Rank'] = df['Hodnoty'].rank()
print(df)

           Kraj    Mesto  Hodnoty  Rank
1  Bratislavsky  Pezinok       54   2.0
2      Trnavsky   Trnava       32   1.0
3       Kosicky   Kosice       87   3.0

In [34]:
df.to_csv('nasedata.csv')  # TU SME HO VYTVORILI
df2 = pd.read_csv('nasedata.csv')
print(df2)

   Unnamed: 0          Kraj    Mesto  Hodnoty
0           0  Bratislavsky  Pezinok       54
1           1      Trnavsky   Trnava       32
2           2       Kosicky   Kosice       87

In [14]:
df2.to_excel('data.xlsx', sheet_name='Namerane Hodnoty')
xlxs = pd.ExcelFile('data.xlsx')
print(xlxs)
df = pd.read_excel(xlxs, 'Namerane Hodnoty')
print(df['Kraj'])

<pandas.io.excel._base.ExcelFile object at 0x00000134FAB71220>
0    Bratislavsky
1        Trnavsky
2         Kosicky
Name: Kraj, dtype: object

In [35]:
f = pd.read_csv('nasedata.csv')
print(f)

   Unnamed: 0          Kraj    Mesto  Hodnoty
0           0  Bratislavsky  Pezinok       54
1           1      Trnavsky   Trnava       32
2           2       Kosicky   Kosice       87

In [18]:
print(f[1:2])  # Pozor neda sa po jednom clenovi ! Musia byt 2 parametre

   Unnamed: 0      Kraj   Mesto  Hodnoty  Rank
1           2  Trnavsky  Trnava       32   1.0

In [22]:
print(f[0:])

   Unnamed: 0          Kraj    Mesto  Hodnoty  Rank
0           1  Bratislavsky  Pezinok       54   2.0
1           2      Trnavsky   Trnava       32   1.0
2           3       Kosicky   Kosice       87   3.0

In [36]:
f.iloc[[2],[2]]

    Mesto
2  Kosice

In [38]:
f.loc[[0], ['Kraj']]

           Kraj
0  Bratislavsky

In [40]:
f.loc[[0], ['Kraj']] = 'Zilinsky'
print(f)

   Unnamed: 0      Kraj    Mesto  Hodnoty
0           0  Zilinsky  Pezinok       54
1           1  Trnavsky   Trnava       32
2           2   Kosicky   Kosice       87

In [41]:
f.shape

(3, 4)

In [42]:
f.index

RangeIndex(start=0, stop=3, step=1)

In [46]:
f.columns

Index(['Unnamed: 0', 'Kraj', 'Mesto', 'Hodnoty'], dtype='object')

In [47]:
f.info

<bound method DataFrame.info of    Unnamed: 0      Kraj    Mesto  Hodnoty
0           0  Zilinsky  Pezinok       54
1           1  Trnavsky   Trnava       32
2           2   Kosicky   Kosice       87>

In [48]:
f.count

<bound method DataFrame.count of    Unnamed: 0      Kraj    Mesto  Hodnoty
0           0  Zilinsky  Pezinok       54
1           1  Trnavsky   Trnava       32
2           2   Kosicky   Kosice       87>